//
//  StringExtension.swift
//  MooDumDum
//
//  Created by Haehyeon Jeong on 09/03/2019.
//  Copyright © 2019 MooDumdum. All rights reserved.
//

import Foundation



extension String{
    static let termsOfServiceContent = """
무덤덤(Moodumdum) 은 익명 네트워크 기반으로 운영합니다. 따라서 이용자분들은 아래 가이드라인을 상시 준수하여야 합니다. 아래 명시된 주제에만 국한되지는 않으며, 임의로 적합하지 않은 컨텐츠임으로 판단될 시 서비스로부터 거부 또는 퇴출할 수 있는 권리를 가집니다.   1.목적

이 약관은 회사가 온라인으로 제공하는 디지털콘텐츠(이하 "콘텐츠"라고 한다) 및 제반서비스의 이용과 관련하여 회사와 이용자와의 권리, 의무 및 책임사항 등을 규정함을 목적으로 합니다.

2. 정의

2.1. “회사”라 함은 "콘텐츠" 산업과 관련된 경제활동을 영위하는 자로서 콘텐츠 및 제반서비스를 제공하는 자를 말합니다.

2.2 ‘회원’이란 회사가 제공하는 서비스에 접속하여 본 약관에 따라 회사의 이용절차에 동의하고 회사가 제공하는 서비스를 이용하는 이용자를 말합니다.

2.3 ‘콘텐츠’란 ‘회원’이 ‘서비스’에 접근하여 생하거나 볼 수 있는 이미지, 텍스트, 음악, 이미지, 동영상, 프로그램, 기타 코드 정보를 말합니다.


3. 회원가입

3.1 회원이 되고자 하는 자는 모바일 단말기로 서비스에 접속하여 서비스 시작 전, "동의", "확인" 등의 버튼을 누르는 방법으로 회원 가입을 완료합니다.

3.2 회원가입계약의 성립시기는 ‘사용자’가 ‘서비스’에 접속하여 ‘약관’의 동의, ‘확인’ 버튼을 클릭한 후 콘텐츠를 볼 수 있는 서비스 화면에 접속한 시점으로 합니다.


4. 서비스의 제공 및 변경
이용자의 개인정보는 원칙적으로 계정 삭제 시 또는 개인정보의 수집 및 이용목적 달성 시 지체 없이 파기합니다. 단, 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다.

5. 개인정보 보호
당사는 개인정보를 보호하기 위한 조치로 개인의 정보를 수집하는 것을 적극적으로 제한하며, 일부 수집되는 정보와 개인 정보는 회사의 개인정보취급방침이 적용됩니다.

6. 서비스의 중단
회사는 컴퓨터 등 정보통신설비의 보수점검•교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있고, 새로운 서비스로의 교체, 기타 회사가 적절하다고 판단하는 사유에 기하여 현재 제공되는 서비스를 완전히 중단할 수 있습니다.


7. 회원 탈퇴 및 자격 상실

7.1 회원은 회사에 언제든지 회원 탈퇴를 요청할 수 있으며 회사는 위 요청을 받은 즉시 해당 회원의 회원의 정보 삭제를 위한 절차를 밟습니다.

7.2 회원 탈퇴가 이루어지면 회원이 작성한 콘텐츠는 회원과의 연결을 모두 끊어 연관 관계가 없도록 조치됩니다.

7.3 회사는 서비스를 이용하는 ‘사용자’가 제 11조 1항에 위배한 사실이 반복되는 경우 적절한 조치를 통하여 자격을 임시 정지하거나 상실시킬 수 있습니다.


8. 회원에 대한 통지
회사가 불특정다수 회원에 대한 통지를 하는 경우 7일 이상 공지사항 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다.


9.회사의 의무

9.1 "회사"는 법령과 이 약관이 정하는 권리의 행사와 의무의 이행을 신의에 좇아 성실하게 하여야 합니다.

9.2 "회사"는 "이용자"가 안전하게 "콘텐츠"를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보보호정책을 공시하고 준수합니다.

9.3 "회사"는 "이용자"가 콘텐츠이용 및 그 대금내역을 수시로 확인할 수 있도록 조치합니다.

9.4 "회사"는 콘텐츠이용과 관련하여 "이용자"로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 지체없이 처리합니다. 이용자가 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우편 등을 통하여 그 처리과정 및 결과를 전달합니다.

9.5 "회사"는 이 약관에서 정한 의무 위반으로 인하여 "이용자"가 입은 손해를 배상합니다.

10. 회원의 의무

10.1 회원은 다음 각 호의 행위를 하여서는 안됩니다.

10.1.1 회사 및 제3자의 지적재산권을 침해하거나 회사의 권리와 업무 또는 제3자의 권리와 활동를 방해하는 행위

10.1.2 관련 법령에 의하여 전송 또는 게시가 금지되는 정보(컴퓨터 프로그램 등)의 게시 또는 전송하는 행위

10.1.3 컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램을 포함하고 있는 자료를 게시하거나 전송하는 행위

10.1.4 불특정 다수의 자를 대상으로 하여 광고 또는 선전을 게시하거나 음란물을 게시하는 행위

10.2 제1항에 해당하는 행위를 한 회원이 있을 경우 회사는 본 약관 제7조에 정한 바에 따라 회원의 회원자격을 적절한 방법으로 제한 및 정지, 상실시킬 수 있습니다.

10.3 회원은 그 귀책사유로 인하여 회사나 다른 회원이 입은 손해를 배상할 책임이 있습니다.


11. ‘콘텐츠’의 삭제 또는 이용제한

11.1 회원의 ‘콘텐츠’의 내용이 다음 각 호에 해당하는 경우 회사는 해당 ‘콘텐츠’에 대한 접근을 임시적으로 차단하거나 영구적으로 삭제하는 조치를 취할 수 있습니다.

11.1.1. 다른 회원 또는 제3자를 비방하거나 중상 모략으로 명예를 손상시키는 내용

11.1.2. 음란물, 욕설 등 공서양속에 위반되는 내용의 정보, 문장, 도형 등을 유포하는 내용

11.1.3. 범죄행위와 관련이 있다고 판단되는 내용

11.1.4. 다른 회원 또는 제3자의 저작권 등 기타 권리를 침해하는 내용

11.1.5. 종교적, 정치적 분쟁을 야기하는 내용으로서, 이러한 분쟁으로 인하여 회사의 업무가 방해되거나 방해되리라고 판단되는 경우

11.1.6. 타인의 개인정보, 사생활을 침해하거나 명예를 손상시키는 경우

11.1.7. 동일한 내용을 중복하여 다수 게시하는 등 게시의 목적에 어긋나는 경우

11.1.8. 불필요하거나 승인되지 않은 광고, 판촉물을 게재하는 경우

11.2 회원이 작성한 ’콘텐츠’로 인한 법률상 이익 침해를 근거로, 다른 회원 또는 제3자가 회원 또는 회사를 대상으로 하여 민형사상의 법적 조치(예:고소, 가처분신청, 손해배상청구소송)를 취하는 동시에 법적 조치와 관련된 게시물의 삭제를 요청해오는 경우, 회사는 동 법적 조치의 결과(예: 검찰의 기소, 법원의 가처분결정, 손해배상판결)가 있을 때까지 관련 게시물에 대한 접근을 잠정적으로 제한할 수 있습니다.


12.면책조항

12.1 ”회사"는 천재지변 또는 이에 준하는 불가항력으로 인하여 "콘텐츠"를 제공할 수 없는 경우에는 "콘텐츠" 제공에 관한 책임이 면제됩니다.

12.2  "회사"는 "이용자"의 귀책사유로 인한 콘텐츠이용의 장애에 대하여는 책임을 지지 않습니다.

12.3 "회사"는 "회원"이 "콘텐츠"와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.

12.4 "회사"는 "이용자" 상호간 또는 "이용자"와 제3자 간에 "콘텐츠"를 매개로 하여 발생한 분쟁 등에 대하여 책임을 지지 않습니다.

13.분쟁의 해결

 "회사"는 분쟁이 발생하였을 경우에 "이용자"가 제기하는 정당한 의견이나 불만을 반영하여 적절하고 신속한 조치를 취합니다. 다만, 신속한 처리가 곤란한 경우에 "회사"는 "이용자"에게 그 사유와 처리일정을 통보합니다.
"""
    static let privacyPolicyContent = """
NEXTERS('Moodumdum'이하 'NEXTERS')은(는) 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.
    
    NEXTERS>('NEXTERS')은(는) 회사는 개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.
    
    ○ 본 방침은부터2019년2월25일부터 시행됩니다.
    
    
    1. 개인정보의 처리 목적NEXTERS('Moodumdum'이하 'NEXTERS')은(는) 개인정보를 다음의 목적을 위해 처리합니다. 처리한 개인정보는 다음의 목적이외의 용도로는 사용되지 않으며 이용 목적이 변경될 시에는 사전동의를 구할 예정입니다.
    
    가. 홈페이지 회원가입 및 관리
    
    회원자격 유지·관리 등을 목적으로 개인정보를 처리합니다.
    
    
    
    
    2. 개인정보 파일 현황
    
    1. 개인정보 파일명 : moodumdum 개인정보파일
    - 개인정보 항목 : 서비스 이용 기록, 접속 로그, 쿠키
    - 수집방법 : 홈페이지, 생성정보 수집 툴을 통한 수집
    - 보유근거 : 고객 가입 및 관리
    - 보유기간 : 준영구
    - 관련법령 : 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년
    
    
    
    
    3. 개인정보의 처리 및 보유 기간
    
    ①('NEXTERS')은(는) 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의 받은 개인정보 보유, 이용기간 내에서 개인정보를 처리,보유합니다.
    
    ② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
    
    1.(홈페이지 회원가입 및 관리)
    (홈페이지 회원가입 및 관리0와 관련한 개인정보는 수집.이용에 관한 동의일로부터(준영구)까지 위 이용목적을 위하여 보유.이용됩니다.
    -보유근거 : 고객 가입 및 관리
    -관련법령 : 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년
    -예외사유 :
    
    4. 정보주체와 법정대리인의 권리·의무 및 그 행사방법 이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.
    
    ① 정보주체는 NEXTERS에 대해 언제든지 개인정보 열람,정정,삭제,처리정지 요구 등의 권리를 행사할 수 있습니다.
    ② 제1항에 따른 권리 행사는NEXTERS에 대해 개인정보 보호법 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 NEXTERS은(는) 이에 대해 지체 없이 조치하겠습니다.
    ③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
    ④ 개인정보 열람 및 처리정지 요구는 개인정보보호법 제35조 제5항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.
    ⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.
    ⑥ NEXTERS은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.
    
    
    
    5. 처리하는 개인정보의 항목 작성
    
    ① NEXTERS('Moodumdum'이하 'NEXTERS')은(는) 다음의 개인정보 항목을 처리하고 있습니다.
    
    1(홈페이지 회원가입 및 관리)
    - 필수항목 : 서비스 이용 기록, 접속 로그, 쿠키
    - 선택항목 :
    
    
    
    
    6. 개인정보의 파기(NEXTERS)('NEXTERS')은(는) 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.
    
    -파기절차
    이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.
    
    -파기기한
    이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.
    
    -파기방법
    전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.
    
    
    
    7. 개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항
    
    NEXTERS 은 정보주체의 이용정보를 저장하고 수시로 불러오는 ‘쿠키’를 사용하지 않습니다.
    
    8. 개인정보 보호책임자 작성
    
    
    ① NEXTERS(‘Moodumdum’이하 ‘NEXTERS) 은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
    
    ▶ 개인정보 보호책임자
    성명 :정해현
    직책 :사원
    직급 :사원
    연락처 :01025436349, wjdgo50@gmail.com,
    ※ 개인정보 보호 담당부서로 연결됩니다.
    
    ▶ 개인정보 보호 담당부서
    부서명 :
    담당자 :
    연락처 :, ,
    ② 정보주체께서는 NEXTERS(‘Moodumdum’이하 ‘NEXTERS) 의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. NEXTERS(‘Moodumdum’이하 ‘NEXTERS) 은(는) 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.
    
    
    
    9. 개인정보 처리방침 변경
    
    ①이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.
    
    
    
    10. 개인정보의 안전성 확보 조치 (NEXTERS)('NEXTERS')은(는) 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.
    
    1. 정기적인 자체 감사 실시
    개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.
    
    2. 비인가자에 대한 출입 통제
    개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.
"""
}
